; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v13 ?v2)
             (pred_3 ?v3 ?v1)
             (pred_12 ?v13 ?v1)
             (pred_1 ?v11 ?v13 )
	     (pred_10 ?v13)
             (pred_8 ?v10)
             (pred_2 ?v3)
             (pred_11 ?v1)
             (pred_5 ?v13)
             (pred_9 ?v3)
             (pred_4 ?v13)
             (pred_6 ))



(:action op_4
:parameters (?v12 ?v4 ?v7 ?v5)
:precondition (and (pred_8 ?v12) (pred_8 ?v4) (pred_2 ?v7) (pred_11 ?v5)
          (pred_7 ?v12 ?v4) (pred_3 ?v7 ?v5)
                   (pred_12 ?v4 ?v5) (pred_10 ?v12) 
                   (pred_5 ?v4) (pred_9 ?v7))
:effect (and  (pred_4 ?v4) (not (pred_5 ?v4))))


(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_8 ?v12) (pred_8 ?v9)
               (pred_10 ?v12) (pred_7 ?v12 ?v9) (pred_4 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v12))))

(:action op_5
:parameters (?v12 ?v7)
:precondition (and (pred_8 ?v12) (pred_2 ?v7) 
                  (pred_10 ?v12) (pred_1 ?v7 ?v12) (pred_6 ))
:effect (and (pred_9 ?v7)
   (not (pred_1 ?v7 ?v12)) (not (pred_6 ))))


(:action op_1
:parameters (?v12 ?v8 ?v6)
:precondition (and (pred_8 ?v12) (pred_2 ?v8) (pred_2 ?v6)
                  (pred_10 ?v12) (pred_9 ?v6) (pred_1 ?v8 ?v12))
:effect (and (pred_9 ?v8) (pred_1 ?v6 ?v12)
        (not (pred_9 ?v6)) (not (pred_1 ?v8 ?v12))))

(:action op_2
:parameters (?v12 ?v7)
:precondition (and (pred_8 ?v12) (pred_2 ?v7) 
                  (pred_10 ?v12) (pred_9 ?v7))
:effect (and (pred_6 ) (pred_1 ?v7 ?v12) (not (pred_9 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_07 obj_20 obj_27 obj_11 obj_24 obj_22 obj_28 obj_18 obj_26 obj_17 obj_09 obj_03 obj_16 obj_13 obj_12 obj_05 obj_04 obj_01 obj_21 obj_10 obj_02 obj_30 obj_23 obj_06
    obj_25 obj_31 obj_08
    obj_14 obj_29 obj_19
    )

    (:init
       (pred_6)

       (pred_8 obj_15)
       (pred_8 obj_07)
       (pred_8 obj_20)
       (pred_8 obj_27)
       (pred_8 obj_11)
       (pred_8 obj_24)
       (pred_8 obj_22)
       (pred_8 obj_28)
       (pred_8 obj_18)
       (pred_8 obj_26)
       (pred_8 obj_17)
       (pred_8 obj_09)
       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_8 obj_13)
       (pred_8 obj_12)
       (pred_8 obj_05)
       (pred_8 obj_04)
       (pred_8 obj_01)
       (pred_8 obj_21)
       (pred_8 obj_10)
       (pred_8 obj_02)
       (pred_8 obj_30)
       (pred_8 obj_23)
       (pred_8 obj_06)
       (pred_11 obj_25)
       (pred_11 obj_31)
       (pred_11 obj_08)
       (pred_2 obj_14)
       (pred_2 obj_29)
       (pred_2 obj_19)

       (pred_7 obj_15 obj_24)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_07 obj_22)
       (pred_7 obj_07 obj_20)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_20 obj_28)
       (pred_7 obj_20 obj_27)
       (pred_7 obj_20 obj_07)
       (pred_7 obj_27 obj_18)
       (pred_7 obj_27 obj_11)
       (pred_7 obj_27 obj_20)
       (pred_7 obj_11 obj_26)
       (pred_7 obj_11 obj_27)
       (pred_7 obj_24 obj_17)
       (pred_7 obj_24 obj_22)
       (pred_7 obj_24 obj_15)
       (pred_7 obj_22 obj_09)
       (pred_7 obj_22 obj_28)
       (pred_7 obj_22 obj_07)
       (pred_7 obj_22 obj_24)
       (pred_7 obj_28 obj_03)
       (pred_7 obj_28 obj_18)
       (pred_7 obj_28 obj_20)
       (pred_7 obj_28 obj_22)
       (pred_7 obj_18 obj_16)
       (pred_7 obj_18 obj_26)
       (pred_7 obj_18 obj_27)
       (pred_7 obj_18 obj_28)
       (pred_7 obj_26 obj_13)
       (pred_7 obj_26 obj_11)
       (pred_7 obj_26 obj_18)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_24)
       (pred_7 obj_09 obj_05)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_22)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_03 obj_28)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_16 obj_18)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_13 obj_21)
       (pred_7 obj_13 obj_26)
       (pred_7 obj_13 obj_16)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_05 obj_02)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_09)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_04 obj_30)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_01 obj_23)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_21 obj_06)
       (pred_7 obj_21 obj_13)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_02 obj_30)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_02 obj_10)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_30 obj_04)
       (pred_7 obj_30 obj_02)
       (pred_7 obj_23 obj_06)
       (pred_7 obj_23 obj_01)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_06 obj_21)
       (pred_7 obj_06 obj_23)
       (pred_5 obj_26)
       (pred_5 obj_11)
       (pred_5 obj_24)
       (pred_12  obj_26 obj_25)
       (pred_12  obj_11 obj_31)
       (pred_12  obj_24 obj_08)
       (pred_4 obj_15)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_27)
       (pred_4 obj_22)
       (pred_4 obj_28)
       (pred_4 obj_18)
       (pred_4 obj_17)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_16)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_05)
       (pred_4 obj_04)
       (pred_4 obj_01)
       (pred_4 obj_21)
       (pred_4 obj_10)
       (pred_4 obj_02)
       (pred_4 obj_30)
       (pred_4 obj_23)
       (pred_4 obj_06)

       (pred_3  obj_14 obj_25)
       (pred_3  obj_29 obj_31)
       (pred_3  obj_19 obj_08)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_29 obj_06)
       (pred_1 obj_19 obj_22)
       (pred_10 obj_30)
    )

    (:goal (and
       (pred_1 obj_14 obj_09)
       (pred_1 obj_19 obj_28)
    ))
(:constraints
  (always (not (pred_10 obj_16)))
)
)

; plan
1. (op_3 obj_30 obj_04)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_04)
   goals met: 0 of 2
2. (op_3 obj_04 obj_03)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_03)
   goals met: 0 of 2
3. (op_3 obj_03 obj_09)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_09)
   goals met: 0 of 2
4. (op_3 obj_09 obj_22)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_22)
   goals met: 0 of 2
5. (op_5 obj_22 obj_19)
   deleted: (pred_1 obj_19 obj_22) (pred_6)
   added: (pred_9 obj_19)
   goals met: 0 of 2
6. (op_3 obj_22 obj_28)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_28)
   goals met: 0 of 2
7. (op_2 obj_28 obj_19)
   deleted: (pred_9 obj_19)
   added: (pred_6) (pred_1 obj_19 obj_28)
   goals met: 1 of 2
8. (op_3 obj_28 obj_03)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_03)
   goals met: 1 of 2
9. (op_3 obj_03 obj_04)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_04)
   goals met: 1 of 2
10. (op_3 obj_04 obj_01)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_01)
   goals met: 1 of 2
11. (op_5 obj_01 obj_14)
   deleted: (pred_1 obj_14 obj_01) (pred_6)
   added: (pred_9 obj_14)
   goals met: 1 of 2
12. (op_3 obj_01 obj_04)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_04)
   goals met: 1 of 2
13. (op_3 obj_04 obj_03)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_03)
   goals met: 1 of 2
14. (op_3 obj_03 obj_09)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_09)
   goals met: 1 of 2
15. (op_2 obj_09 obj_14)
   deleted: (pred_9 obj_14)
   added: (pred_6) (pred_1 obj_14 obj_09)
   goals met: 2 of 2
